export default {
    header: {
        title: "Мы реализуем твои идеи",
        subTitle: "ТВОРИ УЧИСЬ СОЗДАВАЙ",
        nav: {
            work: "КАК МЫ РАБОТАЕМ",
            give: "ЧТО МЫ ПРЕДЛАГАЕМ",
            weAre: "КТО МЫ"
         }
     },
     blocks: {
         aboutUs: {
             title: "О НАС",
             text: "МЫ - ГРУППА",
             subText: "IT-ЭНТУЗИАСТОВ, ОБЪЕДИНЁННЫХ ЦЕЛЬЮ ДАТЬ ПРАКТИЧЕСКИЕ ЗНАНИЯ JUNIOR-СПЕЦИАЛИСТАМ И УСКОРИТЬ ПОЛУЧЕНИЕ ИМИ ПЕРВОГО ОФФЕРА",
             descriptionImg1: "МЕНТОРИНГ",
             descriptionImg2: "IT ПРОЕКТЫ"
         },
         whatAreWeDoing: {
            title: "ЧТО МЫ ДЕЛАЕМ",
            textJun: "JUNIOR-СПЕЦИАЛИСТАМ ПОМОГАЕМ ПОЛУЧИТЬ ОПЫТ НА РЕАЛЬНОМ ПРОЕКТЕ ПОД РУКОВОДСТВОМ МЕНТОРОВ, ЧТОБЫ УСКОРИТЬ ПОЛУЧЕНИЕ ПЕРВОГО ОФФЕРА",
            textMent: "ОПЫТНЫМ СПЕЦИАЛИСТАМ ДАЁМ ВОЗМОЖНОСТЬ РЕАЛИЗОВАТЬСЯ В КАЧЕСТВЕ МЕНТОРА, ПРИМЕНИТЬ СВОИ ЭКСПЕРТНЫЕ ЗНАНИЯ И РАЗВИТЬ СВОИ НАВЫКИ УПРАВЛЕНИЯ КОМАНДОЙ.",
            btnJun: "УЧАСТВОВАТЬ КАК JUNIOR",
            btnMent: "УЧАСТВОВАТЬ КАК МЕНТОР"
         }
     }
} as const 