export default {
    header: {
        title: "Growing the results",
        subTitle: "ТВОРИ УЧИСЬ СОЗДАВАЙ",
        nav: {
            work: "КАК МЫ РАБОТАЕМ",
            give: "ЧТО МЫ ПРЕДЛАГАЕМ",
            weAre: "КТО МЫ",
        },
    },
    blocks: {
        aboutUs: {
            title: "О НАС",
            text: "МЫ - ГРУППА",
            subText:
                "IT-ЭНТУЗИАСТОВ, ОБЪЕДИНЁННЫХ ЦЕЛЬЮ ДАТЬ ПРАКТИЧЕСКИЕ ЗНАНИЯ JUNIOR-СПЕЦИАЛИСТАМ И УСКОРИТЬ ПОЛУЧЕНИЕ ИМИ ПЕРВОГО ОФФЕРА",
            descriptionImg1: "МЕНТОРИНГ",
            descriptionImg2: "IT ПРОЕКТЫ",
        },
        whatAreWeDoing: {
            title: "ЧТО МЫ ПРЕДЛАГАЕМ",
            textJun:
                "JUNIOR-СПЕЦИАЛИСТАМ ПОМОГАЕМ ПОЛУЧИТЬ ОПЫТ НА РЕАЛЬНОМ ПРОЕКТЕ ПОД РУКОВОДСТВОМ МЕНТОРОВ, ЧТОБЫ УСКОРИТЬ ПОЛУЧЕНИЕ ПЕРВОГО ОФФЕРА",
            textMent:
                "ОПЫТНЫМ СПЕЦИАЛИСТАМ ПРЕДОСТАВЛЯЕМ ВОЗМОЖНОСТЬ ПРИМЕНИТЬ И УСОВЕРШЕНСТВОВАТЬ СВОИ ЭКСПЕРТНЫЕ ЗНАНИЯ, РАЗВИТЬ НАВЫКИ ПЕРЕДАЧИ ЗНАНИЙ, РЕАЛИЗОВАТЬСЯ В КАЧЕСТВЕ МЕНТОРА И СДЕЛАТЬ НОВЫЙ ШАГ В КАРЬЕРЕ",
            btnJun: "УЧАСТВОВАТЬ КАК JUNIOR",
            btnMent: "УЧАСТВОВАТЬ КАК МЕНТОР",
        },
        howWeWork: {
            title: "ТЕХНОЛОГИИ",
            text: "МЫ СОЗДАЕМ ОБУЧАЕМ, МОТИВИРУЕМ, ЗНАКОМИМ И ОБЪЕДИНЯЕМ ТАЛАНТЫ ИЗ МИРА IT И БИЗНЕСА",
        },
        counter: {
            title: "КОММЬЮНИТИ",
            text: "Наше сообщество быстро растёт и развивается. Наша команда - целеустремлённые и активные люди, которые стремятся улучшить мир через сотрудничество и реализацию перспективных идей.",
        },
        apply: {
            title: "ПОДАТЬ ЗАЯВКУ",
            descriptionImg1: "МЕНТОР",
            descriptionImg2: "УЧАСТНИК",
            descriptionImg3: "ЗАКАЗЧИК",
        },
        contact: {
            title: "ОСТАВИТЬ ЗАЯВКУ НА УЧАСТИЕ",
        },
    },
} as const;
