export const reviews = [
    {
        id: "1",
        mentor: "Константин,\nМентор площадки Impet Space\nгруппы Java-разработчиков",
        review: "Я Senior Java-разработчик в крупной компании. После достижения определённого уровня профессионализма в разработке мне стало интересно «прокачать» свои навыки наставника, ментора, чтобы понять, получится ли у меня эффективно передавать свой опыт и знания разработчикам, которые только начинают свой путь в профессии. Такую возможность мне предоставила площадка Impet Space.\n\nСотрудничество с площадкой стало моим первым опытом в качестве ментора. Мои начальные опасения относительно организации процесса и профиля участников, к счастью, не подтвердились: коллектив проявил исключительно дружелюбный характер. Все ребята были глубоко мотивированы и с энтузиазмом воспринимали все мои советы и рекомендации, направленные на совершенствование их знаний и умений на будущем профессиональном пути. За время, проведенное вместе, они значительно расширили свои навыки и сейчас я с уверенностью могу заявить, что они готовы к решению сложных задач наравне с более опытными разработчиками.\n\nПомимо пользы для junior-разработчиков, я извлек из процесса обучения ценные уроки и для себя: осознал, как правильно структурировать обучение, определять наиболее эффективные методы, способные привлечь интерес и ускорить усвоение материала. Мне стало ясно, что за короткий промежуток времени я могу поделиться накопленным опытом и направить начинающих разработчиков по проверенным путям, что поможет им избежать многих трудностей, с которыми я сталкивался на начальном этапе своей карьеры. Ведь, как известно, уроки, полученные из чужих ошибок, позволяют обучаться более быстро и экономно.\n\nПолагаю, что ментор на площадке Impet Space получает возможность успешно развивать свои Soft Skills, что поможет ему выступать в качестве лида одного из технических или менеджерских направлений работы компании и расти в карьере.",
        reviews: [
            {
                id: "1",
                junior: "Денис,\nJava-разработчик\nпроекта TWNSND\nплощадки Impet Space",
                review: "Хочу оставить отзыв о менторе Константине!\nЯ был менти Константина на протяжении 2-х месяцев. Он проводил регулярные созвоны, в ходе которых мы разбирали вопросы с  собеседований и углублённо изучали вопросы разработки на Java. Константин также делал код-ревью, советовал, какие технологии использовать, чтобы научить нас писать чистый и оптимальный код. \nЧто мне дала работа с ментором Константином: \n1. Я научился писать чистый код.\n2. Более детально разобрался с внутренней структурой фреймворка. \n3. Научился писать внутренние штуки такие как стартеры. \n4. Разобрался с устройством коллекций.\n5. Узнал много нового о реальном рабочем процессе разработчика. \n6. Стал лучше ориентироваться в вопросах, которые задают на собеседованиях. \n\nКонстантин - отличный ментор и я очень рад тому, что получилось поработать вместе с ним! Хотел бы сказать ему большое спасибо за уделённое время и новые знания.",
            },
            {
                id: "2",
                junior: "Ян,\nJava-разработчик\nпроекта TWNSND\nплощадки Impet Space",
                review: "Константин всегда быстро отвечает на вопросы, ревьюит код, указывает замечания вплоть до грамматических ошибок. На встречах обсуждаем текущие вопросы по проекту, разбираем новые темы, проводим лайв-кодинг в рамках подготовки к собеседованиям. Константин присылает нам подборки интересных материалов для подготовки к встречам. Даёт отзывы и советы по CV.\n\nБлагодаря менторству Константина была значительно улучшена чистота, читаемость и архитектура кода, который мы пишем. Углублены знания по базовым технологиям: java, spring, rest. Освоены новые технологии: feign client, hikariCP, service discovery, circuit breaker, distributed tracing, load balancing, proxy. Планируем проведение тестовых собеседований.\n\nКонстантин объясняет всё  простым и понятным языком, приводит много примеров из практики. С ним очень приятно работать.",
            },
            {
                id: "3",
                junior: "Александр,\nJava-разработчик\nпроекта TWNSND\nплощадки Impet Space",
                review: "За время нашей совместной работы Константин показал себя профессионалом высокого уровня. Регулярные код-ревью от него помогают росту в дизайне, поиску оптимальных решений для реализации бизнес-логики и соответствии принципам и паттернам разработки.\n\nКонстантин всегда готов ответить на любые вопросы и посоветовать решение проблемы. Кроме работы над проектом Константин предлагает домашние задания и проводит регулярные созвоны для изучения новых технологий, проведения технических интервью и разбора накопившихся вопросов.\nТакже Константин провёл ревью резюме и дал фидбэк по его улучшению.\n\nЗа время работы над проектом под менторством Константина мои практические навыки в разработке и теоретические знания технологий значительно выросли. Я очень рад работе под менторством Константина, благодарен ему за то что, он уделяет так много своего времени для того чтобы делиться своими знаниями и опытом.",
            },
            {
                id: "4",
                junior: "Иван,\nJava-разработчик\nпроекта TWNSND\nплощадки Impet Space",
                review: "Мне очень нравится работать с Константином, потому что он всегда быстро отвечает на сообщения, в особенности, если есть какие-то проблемы, он готов помочь подтянуть новые технологии: показать и рассказать про них подробнее, если есть какие-то проблемы.\n\nМы проводим регулярные рабочие созвоны по разработке, за время работы изучили ряд новых технологий, таких как feign client, hikariCP, service discovery, circuit breaker, distributed tracing, load balancing, proxy.\n\nКонстантин также посмотрел и оценил наши CV и дал несколько хороших советов по ним. ",
            },
            {
                id: "5",
                junior: "Наталья,\nProject-менеджер\nпроекта TWNSND\nплощадки Impet Space",
                review: "С удовольствием пишу отзыв на Константина, потому как его работа превысила мои ожидания. Константин является ментором команды бэкенда на моем проекте и кроме стандартных ревью, которых я ожидала, он начал проводить дополнительные встречи с ребятами для повышения их квалификации и улучшения качества их работы.\n\nКонстантин нашёл подход к каждому нашему бэкендеру, постоянно держит контакт с ними, умело корректирует и подсказывает. Он смог замотивировать ребят на работу ещё больше, что не могло положительно не сказаться на результатах нашего проекта.\n\nМне как Project-менеджеру приятно видеть заинтересованность в работе не только у команды разработки, но и у менторов.",
            },
        ],
    },
];
